In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({
        'A': [2, 4, 5691, 13],
        'B': [23, 9.1, 50, 1],
        'C': ['train', 'test', 'test', 'train']
    })

In [3]:
df

      A     B      C
0     2  23.0  train
1     4   9.1   test
2  5691  50.0   test
3    13   1.0  train

In [4]:
df.shape

(4, 3)

In [5]:
df.dtypes

A      int64
B    float64
C     object
dtype: object

In [6]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [7]:
df.columns.values

array(['A', 'B', 'C'], dtype=object)

In [8]:
df

      A     B      C
0     2  23.0  train
1     4   9.1   test
2  5691  50.0   test
3    13   1.0  train

In [9]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
list(df.index)

[0, 1, 2, 3]

In [11]:
range(0,3)

range(0, 3)

In [12]:
list(range(0,3))

[0, 1, 2]

In [13]:
list(range(0,4))

[0, 1, 2, 3]

In [14]:
df

      A     B      C
0     2  23.0  train
1     4   9.1   test
2  5691  50.0   test
3    13   1.0  train

In [15]:
df.index = ['row 0', 'row 1', 'row 2', 'row 3']

In [16]:
df

          A     B      C
row 0     2  23.0  train
row 1     4   9.1   test
row 2  5691  50.0   test
row 3    13   1.0  train

In [17]:
df.columns = ['col A', 'col B', 'col C']

In [18]:
df

       col A  col B  col C
row 0      2   23.0  train
row 1      4    9.1   test
row 2   5691   50.0   test
row 3     13    1.0  train

In [19]:
df['col B']

row 0    23.0
row 1     9.1
row 2    50.0
row 3     1.0
Name: col B, dtype: float64

In [20]:
df.columns.values

array(['col A', 'col B', 'col C'], dtype=object)

In [21]:
df[['col B', 'col C']]

       col B  col C
row 0   23.0  train
row 1    9.1   test
row 2   50.0   test
row 3    1.0  train

In [22]:
df.loc['row 1']

col A       4
col B     9.1
col C    test
Name: row 1, dtype: object

In [23]:
df.loc['row 1', 'col B']

9.1

In [24]:
df.loc[:, 'col B']

row 0    23.0
row 1     9.1
row 2    50.0
row 3     1.0
Name: col B, dtype: float64

In [25]:
df.loc['row 1', :]

col A       4
col B     9.1
col C    test
Name: row 1, dtype: object

In [26]:
df

       col A  col B  col C
row 0      2   23.0  train
row 1      4    9.1   test
row 2   5691   50.0   test
row 3     13    1.0  train

In [27]:
df.iloc[:, 1]

row 0    23.0
row 1     9.1
row 2    50.0
row 3     1.0
Name: col B, dtype: float64

In [28]:
df.iloc[2]

col A    5691
col B      50
col C    test
Name: row 2, dtype: object

In [29]:
df.iloc[2, :]

col A    5691
col B      50
col C    test
Name: row 2, dtype: object

In [30]:
df

       col A  col B  col C
row 0      2   23.0  train
row 1      4    9.1   test
row 2   5691   50.0   test
row 3     13    1.0  train

In [31]:
df.iloc[2,1]

50.0

In [32]:
df

       col A  col B  col C
row 0      2   23.0  train
row 1      4    9.1   test
row 2   5691   50.0   test
row 3     13    1.0  train

In [33]:
df['col A'] + df['col B']

row 0      25.0
row 1      13.1
row 2    5741.0
row 3      14.0
dtype: float64

In [34]:
df['col A'].values + df['col B'].values

array([  25. ,   13.1, 5741. ,   14. ])

In [35]:
df[['col A', 'col B']].sum()

col A    5710.0
col B      83.1
dtype: float64

In [36]:
df

       col A  col B  col C
row 0      2   23.0  train
row 1      4    9.1   test
row 2   5691   50.0   test
row 3     13    1.0  train

In [37]:
df[['col A', 'col B']].sum(axis=1)

row 0      25.0
row 1      13.1
row 2    5741.0
row 3      14.0
dtype: float64

In [38]:
df_sum = df['col A'] + df['col B']

In [39]:
df = df.assign(df_sum=df_sum.values)

In [40]:
df

       col A  col B  col C  df_sum
row 0      2   23.0  train    25.0
row 1      4    9.1   test    13.1
row 2   5691   50.0   test  5741.0
row 3     13    1.0  train    14.0

In [41]:
df

       col A  col B  col C  df_sum
row 0      2   23.0  train    25.0
row 1      4    9.1   test    13.1
row 2   5691   50.0   test  5741.0
row 3     13    1.0  train    14.0

In [42]:
df_sum = df['col A'] + df['col B']

In [43]:
df.append(df_sum, ignore_index=True)

    col A  col B  col C  df_sum  row 0  row 1   row 2  row 3
0     2.0   23.0  train    25.0    NaN    NaN     NaN    NaN
1     4.0    9.1   test    13.1    NaN    NaN     NaN    NaN
2  5691.0   50.0   test  5741.0    NaN    NaN     NaN    NaN
3    13.0    1.0  train    14.0    NaN    NaN     NaN    NaN
4     NaN    NaN    NaN     NaN   25.0   13.1  5741.0   14.0

In [44]:
df

       col A  col B  col C  df_sum
row 0      2   23.0  train    25.0
row 1      4    9.1   test    13.1
row 2   5691   50.0   test  5741.0
row 3     13    1.0  train    14.0

In [45]:
df['sum'] = df['col A'] + df['col B']

In [46]:
df

       col A  col B  col C  df_sum     sum
row 0      2   23.0  train    25.0    25.0
row 1      4    9.1   test    13.1    13.1
row 2   5691   50.0   test  5741.0  5741.0
row 3     13    1.0  train    14.0    14.0

In [47]:
df.loc['row 4'] = [1, 2, 3, 4, 6]

In [48]:
df

       col A  col B  col C  df_sum     sum
row 0      2   23.0  train    25.0    25.0
row 1      4    9.1   test    13.1    13.1
row 2   5691   50.0   test  5741.0  5741.0
row 3     13    1.0  train    14.0    14.0
row 4      1    2.0      3     4.0     6.0